In [1]:
datafile = "/Users/swethakolalapudi/Downloads/titanicdata.htm"

In [2]:
from bs4 import BeautifulSoup
with open(datafile,"r") as f:
    soup = BeautifulSoup(f,"html.parser")

WARNING:bs4.dammit:Some characters could not be decoded, and were replaced with REPLACEMENT CHARACTER.

In [3]:
table = soup.find('table')

In [4]:
import pandas as pd
data = pd.read_html(str(table),flavor='bs4')[0]

In [5]:
data.head()

,Name,Age,Class/Dept,Ticket,Joined,Job,Boat [Body],Unnamed: 7
0,"ABÄ«-AL-MUNÃ , Mr NÄ�sÄ«f QÄ�sim",27,3rd Class Passenger,2699Â£18 15s 9d,Cherbourg,Â,15Â,NaN
1,"ABBING, Mr Anthony",42,3rd Class Passenger,5547Â£7 11s,Southampton,Blacksmith Â,Â Â,NaN
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,CA2673Â£20 5s,Southampton,Â,AÂ,NaN
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,CA2673Â£20 5s,Southampton,Jeweller Â,Â [190],NaN
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,CA2673Â£20 5s,Southampton,Scholar Â,Â Â,NaN

In [6]:
data = data[["Name","Age","Class/Dept","Boat [Body]"]]

In [7]:
data.head()

                               Name Age           Class/Dept Boat [Body]
0  ABÄ«-AL-MUNÃ , Mr NÄ�sÄ«f QÄ�sim  27  3rd Class Passenger         15Â
1                ABBING, Mr Anthony  42  3rd Class Passenger         Â Â
2     ABBOTT, Mrs Rhoda Mary 'Rosa'  39  3rd Class Passenger          AÂ
3        ABBOTT, Mr Rossmore Edward  16  3rd Class Passenger     Â [190]
4          ABBOTT, Mr Eugene Joseph  13  3rd Class Passenger         Â Â

In [8]:
def cleanup(value):
    return value.encode('ascii', errors='replace').replace("?"," ")

data['Name']= data['Name'].apply(cleanup)
data['Boat [Body]']= data['Boat [Body]'].apply(cleanup)
data.head()

                               Name Age           Class/Dept Boat [Body]
0  AB  -AL-MUN  , Mr N  s  f Q  sim  27  3rd Class Passenger         15
1                ABBING, Mr Anthony  42  3rd Class Passenger
2     ABBOTT, Mrs Rhoda Mary 'Rosa'  39  3rd Class Passenger          A
3        ABBOTT, Mr Rossmore Edward  16  3rd Class Passenger       [190]
4          ABBOTT, Mr Eugene Joseph  13  3rd Class Passenger

In [9]:
def checkPass(class_type):
    if "Passenger" in class_type:
        return "Passenger"
    else:
        return "Crew"
    
data["Crew/Pass"]=data["Class/Dept"].apply(checkPass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger

In [10]:
def checkClass(class_type):
    if "Passenger" in class_type:
        return class_type.split(" ")[0]
    else:
        return "Crew"
    
data["Class"]=data["Class/Dept"].apply(checkClass)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd

In [11]:
def checkAdult(age):
    if age>=18:
        return "Adult"
    else:
        return "Child"
    
data["Adult/Child"]=data["Age"].apply(checkAdult)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd,Adult
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd,Adult
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd,Adult
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd,Adult
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd,Adult

In [12]:
def checkGender(name):
    firstname = name[name.index(",")+2:]
    salutation = firstname.split(" ")[0]
    if salutation in ["Mr","Master"]:
        return "Male"
    else:
        return "Female"

In [13]:
data["Gender"]=data["Name"].apply(checkGender)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd,Adult,Male
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd,Adult,Male
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd,Adult,Female
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd,Adult,Male
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd,Adult,Male

In [14]:
def checkSurvival(boat):
    if boat.strip()=="" or "[" in boat:
        return 0
    else:
        return 1
data["Survival"]=data["Boat [Body]"].apply(checkSurvival)
data.head()

,Name,Age,Class/Dept,Boat [Body],Crew/Pass,Class,Adult/Child,Gender,Survival
0,"AB -AL-MUN , Mr N s f Q sim",27,3rd Class Passenger,15,Passenger,3rd,Adult,Male,1
1,"ABBING, Mr Anthony",42,3rd Class Passenger,,Passenger,3rd,Adult,Male,0
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,A,Passenger,3rd,Adult,Female,1
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,[190],Passenger,3rd,Adult,Male,0
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,,Passenger,3rd,Adult,Male,0

In [15]:
data.groupby(['Crew/Pass'])['Survival'].sum()*100/data.groupby(['Crew/Pass'])['Survival'].count()

Crew/Pass
Crew         13.586957
Passenger    35.798817
Name: Survival, dtype: float64

In [16]:
def compare(group,data):
    return data.groupby([group])['Survival'].sum()*100/data.groupby([group])['Survival'].count()

compare("Class",data)

Class
1st     57.428571
2nd     37.883959
3rd     24.259520
Crew    13.586957
Name: Survival, dtype: float64

In [17]:
compare("Gender",data)

Gender
Female    59.272097
Male      15.540181
Name: Survival, dtype: float64

In [18]:
compare("Adult/Child",data)

Adult/Child
Adult    26.122785
Child     0.000000
Name: Survival, dtype: float64

In [19]:
trainingData=data[["Age","Crew/Pass","Class","Adult/Child","Gender","Survival"]]
trainingData.head()

  Age  Crew/Pass Class Adult/Child  Gender  Survival
0  27  Passenger   3rd       Adult    Male         1
1  42  Passenger   3rd       Adult    Male         0
2  39  Passenger   3rd       Adult  Female         1
3  16  Passenger   3rd       Adult    Male         0
4  13  Passenger   3rd       Adult    Male         0

In [20]:
def catToNum(series):
    series = series.astype('category')
    return series.cat.codes

catData=trainingData[["Crew/Pass","Class","Adult/Child","Gender"]].apply(catToNum)
trainingData[["Crew/Pass","Class","Adult/Child","Gender"]]=catData
trainingData.head()

/Users/swethakolalapudi/anaconda/lib/python2.7/site-packages/pandas/core/frame.py:2440: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[k1] = value[k2]

  Age  Crew/Pass  Class  Adult/Child  Gender  Survival
0  27          1      2            0       1         1
1  42          1      2            0       1         0
2  39          1      2            0       0         1
3  16          1      2            0       1         0
4  13          1      2            0       1         0

In [21]:
trainingData['Age'] = trainingData['Age'].apply(pd.to_numeric, errors='coerce')

/Users/swethakolalapudi/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [22]:
len(trainingData)

2456

In [23]:
trainingData = trainingData.dropna()
len(trainingData)

2426

In [24]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(trainingData, test_size = 0.2)

In [25]:
train.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
789   48.0          1      0            0       0         1
980   23.0          1      2            0       0         0
19    46.0          1      2            0       1         1
699   34.0          0      3            0       1         0
1202  43.0          0      3            0       1         0

In [26]:
test.head()

       Age  Crew/Pass  Class  Adult/Child  Gender  Survival
1265  31.0          1      1            0       1         0
2050  31.0          0      3            0       1         0
1797  52.0          1      0            0       0         1
665   24.0          1      2            0       1         1
2193  54.0          1      0            0       1         0

In [27]:
len(train)

1940

In [28]:
len(test)

486

In [29]:
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier(max_leaf_nodes=25)
clf=clf.fit(train[["Age","Crew/Pass","Class","Adult/Child","Gender"]],train["Survival"])

In [30]:
clf

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=25, min_impurity_split=1e-07,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [31]:
clf.feature_importances_

array([ 0.17577204,  0.        ,  0.28001486,  0.        ,  0.5442131 ])

In [32]:
from sklearn import tree
with open("titanic.dot","w") as f:
    f = tree.export_graphviz(clf,
                            feature_names=["Age","Crew/Pass","Class","Adult/Child","Gender"],out_file=f)

In [33]:
predictions = clf.predict(test[["Age","Crew/Pass","Class","Adult/Child","Gender"]])

In [34]:
from sklearn.metrics import accuracy_score
accuracy_score(test["Survival"], predictions)

0.7880658436213992

In [35]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier(n_estimators=1000,max_leaf_nodes=15)

In [36]:
clf

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=15,
            min_impurity_split=1e-07, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            n_estimators=1000, n_jobs=1, oob_score=False,
            random_state=None, verbose=0, warm_start=False)

In [37]:
def checkAccuracy(clf):
    clf=clf.fit(train[["Age","Crew/Pass","Class","Adult/Child","Gender"]],train["Survival"])
    predictions = clf.predict(test[["Age","Crew/Pass","Class","Adult/Child","Gender"]])
    return accuracy_score(test["Survival"], predictions)

In [38]:
checkAccuracy(clf)

0.80658436213991769